import { useState } from 'react';
import { Collapse } from 'antd';
import bg from '../../assets/Faq/FAQ.png'
import man from "../../assets/Faq/1.png"
const FAQ = () => {
  const [activeKey, setActiveKey] = useState('1');
  const courseData = [
    {
      key: '1',
      label: `FAQ 1: "এই মাইক্রো ওয়ার্কশপ আসলে কী?"`,
      content: `আপনি হয়তো অনেক জায়গায় শিখতে গিয়েছেন, অনেক কোর্স দেখেছেন, কিন্তু স্পষ্টভাবে বুঝতে পারেননি—আসলেই কিভাবে ইনকাম শুরু করবেন! এত ইনফরমেশন থাকলেও, গাইডলাইন কম! <br> <br> "কোথা থেকে শুরু করবো?"—এই প্রশ্নের উত্তর না পেয়ে হয়তো বারবার পিছিয়ে যাচ্ছেন! মনে হচ্ছে সবকিছু জানেন, কিন্তু কাজের পর্যায়ে গিয়ে আটকে যাচ্ছেন! <br> <br> এই মাইক্রো ওয়ার্কশপ <b>একটি সম্পূর্ণ রোডম্যাপ প্রদান করে, অনলাইনে সেগুলো থেকে আয় করতে এবং দক্ষতার ভিত্তিতে Job পেতে সহায়তা করে </b>, ঠিক সেখানেই হেল্প করবে! এটা একটা <b> 100% প্র্যাকটিকাল ওয়ার্কশপ </b>, যেখানে হাতে-কলমে গাইডলাইন পাবেন <b> ফাস্ট ইনকামের জন্য টেস্টেড মেথড! </b> লাইভ ডেমো + স্টেপ-বাই-স্টেপ প্রসেস <b> = কাজ করা, ইনকাম শুরু করা! </b>`
    },
    { key: '2', label: `FAQ 2: "ওয়ার্কশপে কী কী করতে হবে?"`, content: `অনেকেই স্কিল শিখতে চায় ও টাস্ক পূরণ করে ইনকাম করতে চায়, কিন্তু বুঝতে পারে না কোন স্কিল সহজে শেখা যায় এবং দ্রুত আয় করা সম্ভব! ফলে স্কিল শেখার মাঝেই হতাশ হয়ে যায়। <br> <br>
বাজারে হাজারো স্কিলের নাম শুনেছেন, কিন্তু কোনটা আপনার জন্য পারফেক্ট? সবকিছু একসাথে শিখতে গেলে সময় বেশি লাগে, অথচ শুরুতেই ইনকাম দরকার! <br> <br>
এই ওয়ার্কশপে আপনি এমন 3-5টা স্পেসিফিক ইনকাম মেথড শিখবেন যা লো-কম্পিটিশন, হাই-ডিমান্ড এবং সাধারণ স্কিলেই সম্ভব! লাইভ ডেমো, অ্যাকশন প্ল্যান, আর রেডিমেড ইনকাম স্ট্র্যাটেজি!` },
    { key: '3', label: `FAQ 3: "সাপোর্ট পাবো কীভাবে?"`, content: `অনেক ওয়ার্কশপের সমস্যা হলো, RoadMap+ Class শেষে সাপোর্ট পাওয়া যায় না! শেখার পর যখন রিয়েল লাইফে কাজ করতে যান, তখন বাধা আসলে কেউ হেল্প করে না! <br> <br>
ফেসবুকে পোস্ট দেন, কিন্তু উত্তর পান না! কারো কাছে প্রশ্ন করতে গেলেও সঠিক গাইডলাইন মেলে না! ফলে শেখা কন্টিনিউ করা কঠিন হয়ে যায়। <br> <br>
এই ওয়ার্কশপে লাইফটাইম সাপোর্ট থাকছে! গ্রুপ সাপোর্ট + লাইভ Q&A +ওয়াটসঅ্যাপ সাপোর্ট (01660013379)+ ফাস্ট রিপ্লাই সিস্টেম! শেখা = ইমপ্লিমেন্ট = ইনকাম—পুরো প্রসেসেই আপনাকে গাইড করা হবে! যতদিন প্রয়োজন, সাপোর্ট পাওয়া যাবে!
`},
    { key: '4', label: `FAQ 4: "এই মাইক্রো ওয়ার্কশপ কেন দরকার?"`, content: `আপনি হয়তো ফ্রিল্যান্সিং/ডিজিটাল মার্কেটিং/অনলাইন ইনকাম নিয়ে অনেকদিন ভাবছেন, কিন্তু কাজ শুরু করতে পারছেন না! <br> <br>
শুধু জানলেই হয় না, কাজ করতে হয়! কিন্তু গাইডলাইন না থাকলে কাজ করা সম্ভব হয় না! ফ্রিল্যান্সিং-এ এন্ট্রি পাওয়া কঠিন হয়ে যায়! <br> <br>
এই মাইক্রো ওয়ার্কশপ শুধু শেখাবে না, বরং কাজ করিয়ে নেবে+ টাস্ক পূরণ ইনকাম দিবে ! হাতে-কলমে গাইড করবে কোথায় কাজ করবেন, কীভাবে করবেন, কিভাবে প্রথম ইনকাম করবেন! ` },
    { key: '5', label: `FAQ 5: "ওয়ার্কশপের প্রাইস কত?"`, content: `অনেক ভালো ওয়ার্কশপের প্রাইস এত বেশি যে অনেকের পক্ষে অ্যাফোর্ড করা সম্ভব হয় না! <br> <br>
আপনি যদি একটা অফোর্ডেবল, অথচ হাই-ভ্যালু ওয়ার্কশপ চান, তাহলে অপশন কম! বেশিরভাগ ওয়ার্কশপ শুধু থিওরি শেখায়, কিন্তু এই ওয়ার্কশপ রিয়েল একশন প্ল্যান দেবে!  <br> <br>
একদম সিম্পল, মাত্র ৯৯৯ টাকা! এত কম দামে প্র্যাকটিকাল ওয়ার্কশপ + ইনকাম স্ট্র্যাটেজি + লাইফটাইম সাপোর্ট—এরকম অফার খুব কম পাওয়া যায়!` },
    { key: '6', label: `FAQ 06: "কীভাবে এই ইনকাম প্যাকেজ কিনবো?"`, content: `আপনি যদি এই ইনকাম প্যাকেজ কিনতে চান, তাহলে প্রথমে পেমেন্ট কমপ্লিট করতে হবে। <br> <br>
আপনি এই ইনকাম প্যাকেজটি বিভিন্ন জনপ্রিয় পেমেন্ট মেথডে কিনতে পারবেন- <br> <br>

Bkash: 01804344627 [Payment/Cash In/Bank to Bkash] [টাকা] <br>
Nagad: 01804344627 [Payment/Cash In/Bank to Nagad] [টাকা] <br>
Rocket: 01804344627 [Payment/Cash In/Bank to Rocket] [টাকা] <br>
Skrill: <br>
Neteller: <br>
Binance Pay Id: 1033997603  [ডলার/ক্রিপ্টো] <br> <br>

যেকোনো পেমেন্ট মেথডে টাকা পাঠিয়ে, আপনার পেমেন্ট ডিটেইলস হোয়াটসঅ্যাপে কনফার্ম করুন।
পেমেন্ট ভেরিফিকেশন হয়ে গেলে, আপনাকে ইনকাম প্যাকেজের সম্পূর্ণ অ্যাক্সেস দেওয়া হবে!` },
{ key: '7', label: `FAQ 07: "আমার স্কিল আছে, আমি কাজ পারি, আমি কি ফ্রিতেই এই প্যাকেজ নিতে পারবো?"`, content: `
যেহেতু আপনার স্কিল আছে, আপনি কাজ পারেন। তাহলে, আমার ইনবক্স এ এসএমএস করুন এবং পূর্বে কাজের অভিজ্ঞতা থেকে আমাকে কাজের প্রুফ দিন। <br>
আপনি যদি আগেও কোনো Workshop কিনে থাকেন, তাহলে ভাবছেন এই প্যাকেজ ফ্রিতে পাবেন কি না। <br>
এই প্যাকেজ আলাদা , তাই আপনাকে সম্পূর্ণ পেমেন্ট করে কিনতে হবে। 
নতুন ও আপডেটেড ইনকাম স্ট্র্যাটেজির মাধ্যমে, আপনি আরও ভালোভাবে আয় করতে পারবেন।` },
{ key: '8', label: `FAQ 08: "আমি TAKA ফেরত চাই, কীভাবে রিফান্ড নেবো?"`, content: `
  
 আপনি যদি প্যাকেজ কিনেও ইনকাম করতে না পারেন, তাহলে Taka Return সুযোগ আছে। <br>
আপনার করা হোমওয়ার্ক ও প্র্যাকটিসের প্রমাণ দিন, এবং হোয়াটসঅ্যাপে মেসেজ করুন। <br>
পেমেন্ট ভেরিফিকেশন শেষ হওয়ার পর, ১-৩ কর্মদিবসের মধ্যে পুরো টাকা ফেরত পাবেন!` },
  { key: '9', label: `FAQ 09: "এই ইনকাম প্যাকেজের সবগুলো Workshop Roadmap ভালোভাবে কমপ্লিট করতে কতদিন সময় লাগবে?"`, content: `
    আপনি জানতে চাচ্ছেন, কতদিনে প্যাকেজ শেষ করা সম্ভব। <br>
প্রতিদিন ৩ ঘণ্টা সময় দিন এবং 1 মাসের মধ্যে সবকিছু কমপ্লিট করুন। <br>
স্কিল ডেভেলপ করে, ১ সপ্তাহের মধ্যে ইনকাম শুরু করতে পারবেন! আর টাস্ক পূরণ করে রেগুলার ডেইলি ইনকাম কয়েন ইনকাম সেট করে দেওয়া হবে।
    নতুন ও আপডেটেড ইনকাম স্ট্র্যাটেজির মাধ্যমে, আপনি আরও ভালোভাবে আয় করতে পারবেন।` },
    { key: '10', label: `FAQ 10: "এই ইনকাম প্যাকেজ কি মোবাইল দিয়ে করা যাবে?"`, content: `
আপনার কম্পিউটার নেই, তাই ভাবছেন মোবাইল দিয়ে প্যাকেজ কমপ্লিট করা যাবে কি না। <br>
মোবাইল দিয়েও কাজ করা সম্ভব, তবে কিছু ক্ষেত্রে কম্পিউটার থাকলে আরও সুবিধা হবে। <br>
যেকোনো ডিভাইস থেকেই শেখা ও ইনকাম করা সম্ভব!` },
      { key: '11', label: `FAQ 11: "ইনকাম প্যাকেজ সম্পর্কে আরো জানতে চাই"`, content: `
        
আপনি ইনকাম প্যাকেজ সম্পর্কে আরও জানতে চান। <br>
 ইমেইল, ফোন, Whatsapp বা সোশ্যাল মিডিয়া চ্যানেল দিয়ে যোগাযোগ করুন। <br>
প্রয়োজনীয় সকল তথ্য দ্রুত পেয়ে যাবেন!` },
  
  ];

  return (
    <div
      className=" justify-center text-white items-center  overflow-hidden px-6 lg:px-0 -mt-20 py-24"
      style={{
        backgroundImage: `url(${bg})`,
        backgroundSize: 'cover',
        backgroundPosition: 'center',
        backgroundRepeat: 'no-repeat',
      }}
    >
      <div className=' max-w-[1320px] mx-auto sm:py-32 text-white'>
        <h1 className="heading text-left">Hear from Our Happy Clients</h1>
        <p className="description mt-2 md:mt-3 lg:mt-4">
          Trusted by hundreds, loved by all—here’s{" "}
          <br className="hidden md:block" /> what they have to share.
        </p>
        <div className='flex  flex-col lg:flex-row gap-6'>
          <div className='w-full lg:w-2/5 flex justify-center items-center'>
            <img src={man} className="w-full" alt="FAQ Illustration" />
          </div>
          <div className=" w-full lg:w-3/5 bg-[#F38122] rounded-xl">

            {/* Collapse section */}
            <div className="w-full p-[30px] mt-4 home1Faq">
              <Collapse
                accordion
                activeKey={activeKey}
                onChange={setActiveKey}
                expandIconPosition="end"
                expandIcon={({ isActive }) => (
                  <span
                    style={{
                      fontSize: '30px',
                      color: isActive ? 'white' : 'white',
                      transition: 'transform 0.5s ease',
                      marginTop: '-2px',
                    }}
                  >
                    {isActive ? '-' : '+'}
                  </span>
                )}
                className="!bg-transparent"
              >
                {courseData.map((item) => (
                  <Collapse.Panel
                    key={item.key}
                    header={
                      <div className="flex items-center justify-between">
                        <span
                          className={`${activeKey === item.key ? 'text-white' : 'text-[#FFF]'} heading3 text-white font-semibold flex items-center`}
                        >
                          {item.label}
                        </span>
                      </div>
                    }
                    className='mb-6 !border !border-[#78120D] !rounded-[12px]'
                  >
                   <p className='px-10 description' dangerouslySetInnerHTML={{ __html: item.content }}></p>
                    
                  </Collapse.Panel>
                ))}
              </Collapse>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default FAQ;

